# IFC_DMSetFieldEmpty

## Description
Sets the indicated field empty.

```pascal
FUNCTION IFC_DMSetFieldEmpty(
				inStrObjName   : STRING;
				inStrEntryName : STRING;
				inStrFieldName : STRING;
				bEmpty         : BOOLEAN) : BOOLEAN;
```

```python

def vs.IFC_DMSetFieldEmpty(inStrObjName, inStrEntryName, inStrFieldName, bEmpty):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrObjName|STRING||
|inStrEntryName|STRING||
|inStrFieldName|STRING||
|bEmpty|BOOLEAN||

## Version
Availability: from Vectorworks 2017
## Category
* IFC